In [ ]:
#A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

#Features of DataFrame
#Potentially columns are of different types
#Size – Mutable
#Labeled axes (rows and columns)
#Can Perform Arithmetic operations on rows and columns

#Structure Table
#You can think of it as an SQL table or a spreadsheet data representation.

#pandas.DataFrame
#A pandas DataFrame can be created using the following constructor −
#pandas.DataFrame( data, index, columns, dtype, copy)

In [1]:
#https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm
#Following is the CONSTRUCTORE of pandas frame
#pandas.DataFrame( data, index, columns, dtype, copy)
# Dependencies and Setup

import pandas as pd
import numpy as np

file_to_load = "/Users/vijaysaxena/UCBERKDATA/GitLab/UCBER201805DATA2-Class-Repository-DATA/02A-Homework/04-Numpy-Pandas/Instructions/HeroesOfPymoli/Resources/purchase_data.csv"

purchase_data = pd.read_csv(file_to_load)

purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [6]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [7]:
data=[['Alex',10],['bob',12],['clark',30]]
df=pd.DataFrame(data)
df

       0   1
0   Alex  10
1    bob  12
2  clark  30

In [8]:
data=[['Alex',10],['bob',12],['clark',30]]
df=pd.DataFrame(data, columns=['Name','Age'])
df

    Name  Age
0   Alex   10
1    bob   12
2  clark   30

In [9]:
data=[['Alex',10],['bob',12],['clark',30]]
df=pd.DataFrame(data, columns=['Name','Age'],dtype=float)
df

    Name   Age
0   Alex  10.0
1    bob  12.0
2  clark  30.0

In [10]:
data={'Name':['Tom','Jack','Steve','Ricky'],
      'Age':[28,34,29,42]
     }
df=pd.DataFrame(data)
df

   Age   Name
0   28    Tom
1   34   Jack
2   29  Steve
3   42  Ricky

In [13]:
data={'Name':['Tom','Jack','Steve','Ricky'],
      'Age':[28,34,29,42]
     }
df=pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

  Age   Name
   28    Tom
   34   Jack
   29  Steve
   42  Ricky

In [14]:
df=pd.DataFrame(data, index=['','','',''])
df

  Age   Name
   28    Tom
   34   Jack
   29  Steve
   42  Ricky

In [20]:
df=pd.DataFrame(data, index=[10,20,30,40])
df

    Age   Name
10   28    Tom
20   34   Jack
30   29  Steve
40   42  Ricky

In [21]:
data=[{'a':1,'b':2},{'a':5,'b':10,'c':20}]
df=pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [22]:
df=pd.DataFrame(data,index=['First','Second'])
df

        a   b     c
First   1   2   NaN
Second  5  10  20.0

In [28]:
data=[{'a':1,'b':2},{'a':5,'b':10,'c':20}]

#With two column indices, values same as dictionary keys
df1=pd.DataFrame(data,index=['First','Second'], columns=['a','b'])

#With two column indices with one index with other name
df2=pd.DataFrame(data,index=['First','Second'], columns=['a','d1'])

In [29]:
df1

        a   b
First   1   2
Second  5  10

In [30]:
df2

        a  d1
First   1 NaN
Second  5 NaN

In [31]:
#Create a DataFrame from Dict of Series
data_series={'one':pd.Series([1,2,3], index=['a','b','c']),
            'two':pd.Series([1,2,3,4], index=['a','b','c','d'])
            }
df=pd.DataFrame(data_series)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [32]:
#Column Selection
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [33]:
df.one

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [34]:
#Column Addition
print ("Adding a new column by passing as Series:")
df['three']=pd.Series([10,20,30],index=['a','b','c'])
df

Adding a new column by passing as Series:

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [36]:
print ("Adding a new column using the existing columns in DataFrame:")
df['four']=df['one']+df['three']
df

Adding a new column using the existing columns in DataFrame:

   one  two  three  four
a  1.0    1   10.0   0.1
b  2.0    2   20.0   0.1
c  3.0    3   30.0   0.1
d  NaN    4    NaN   NaN

In [38]:
#Column Deletion
#Columns can be deleted or popped;
data={
    'one':pd.Series([1,2,3], index=['a','b','c']),
    'two':pd.Series([1,2,3,4], index=['a','b','c','d']),
    'three':pd.Series([10,20,30],index=['a','b','c'])
}
df=pd.DataFrame(data)
df

   one  three  two
a  1.0   10.0    1
b  2.0   20.0    2
c  3.0   30.0    3
d  NaN    NaN    4

In [39]:
# deleteing column using del function
del df['one']
df

   three  two
a   10.0    1
b   20.0    2
c   30.0    3
d    NaN    4

In [41]:
#Deleting column using pop function
df.pop('two')
df

   three
a   10.0
b   20.0
c   30.0
d    NaN

In [43]:
#Row Selection, Addition, and Deletion


data={
    'one':pd.Series([1,2,3], index=['a','b','c']),
    'two':pd.Series([1,2,3,4], index=['a','b','c','d']),
    'three':pd.Series([10,20,30],index=['a','b','c'])
}
df=pd.DataFrame(data)
df

   one  three  two
a  1.0   10.0    1
b  2.0   20.0    2
c  3.0   30.0    3
d  NaN    NaN    4

In [44]:
#Selection by Label
#Rows can be selected by passing row label to a loc function.
df.loc['b']
#The result is a series with labels as column names of the DataFrame. 
#And, the Name of the series is the label with which it is retrieved

one       2.0
three    20.0
two       2.0
Name: b, dtype: float64

In [45]:
#Selection by integer location
#Rows can be selected by passing integer location to an iloc function
df.iloc[2]

one       3.0
three    30.0
two       3.0
Name: c, dtype: float64

In [47]:
#Slice Rows
#Multiple rows can be selected using ‘ : ’ operator.
df[2:4]

   one  three  two
c  3.0   30.0    3
d  NaN    NaN    4

In [58]:
#Addition of Rows
#Add new rows to a DataFrame using the append function. This function will append the rows at the end.
df = pd.DataFrame([[1, 2], [3, 4,9]], columns = ['a','b','d'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df=df.append(df2)
df

   a  b    d
0  1  2  NaN
1  3  4  9.0
0  5  6  NaN
1  7  8  NaN

In [ ]:
#Deletion of Rows
#Use index label to delete or drop rows from a DataFrame. 
#If label is duplicated, then multiple rows will be dropped.

#If you observe, in the above example, the labels are duplicate. 
#Let us drop a label and will see how many rows will get dropped.

In [59]:
# Drop rows with label=0
df = df.drop(0)
df
#In the above example, 
#two rows were dropped because those two contain the same label 0

   a  b    d
1  3  4  9.0
1  7  8  NaN